# parameters
nc: 3  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # Two Stream
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9

   [-4, 1, Conv, [64, 6, 2, 2]],  # 10-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 11-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 13-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 15-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 17-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 19

   [[4,14], 1, LFEM, [256]],    # 20 two stream fuse
   [[6,16], 1, LFEM, [512]],    # 21 two stream fuse
   [[9,19], 1, LFEM, [1024]],    # 22 two stream fuse

   [20, 1, NLFEM, [256]],   # 23-P3/8 fusion backbone P3
   [21, 1, NLFEM, [512]],   # 24-P4/16 fusion backbone P4
   [22, 1, NLFEM, [1024]],   # 25-P5/32 fusion backbone P5

   [23, 1, FDFTM, [256]],   # 26-P3/8 fusion backbone P3
   [24, 1, FDFTM, [512]],   # 27-P4/16 fusion backbone P4
   [25, 1, FDFTM, [1024]],   # 28-P5/32 fusion backbone P5
  ]


# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],          # 29
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 30
   [[-1, 27], 1, Concat, [1]],           # 31 cat backbone P4
   [-1, 3, C3, [512, False]],           # 32

   [-1, 1, Conv, [256, 1, 1]],          # 33
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 34
   [[-1,26], 1, Concat, [1]],           # 35 cat backbone P3
   [-1, 3, C3, [256, False]],           # 36 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],          # 37
   [[-1, 33], 1, Concat, [1]],           # 38 cat head P4
   [-1, 3, C3, [512, False]],           # 39 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],          # 40
   [[-1, 29], 1, Concat, [1]],           # 41 cat head P5
   [-1, 3, C3, [1024, False]],          # 42 (P5/32-large)

   [[36, 39, 42], 1, Detect, [nc, anchors]],    # Detect(P3, P4, P5)
  ]